Repository: diegoaces/flutter-pokedex-challenge
Catalog: lib/l10n/app_*.arb
Languages: es

# appTitle
source: Pokedex App
es: PokeApp

# onboardingTitle1
source: All Pokémon in one place
es: Todos los Pokémon en un solo lugar

# onboardingTitle2
source: Keep your Pokédex up to date
es: Mantén tu Pokédex actualizada

# onboardingSubtitle1
source: Access a wide list of Pokémon from all generations created by Nintendo
es: Accede a una amplia lista de Pokémon de todas las generaciones creadas por Nintendo

# onboardingSubtitle2
source: Sign up and save your profile, favorite Pokémon, settings and much more in the app
es: Registrate y guarda tu perfil, Pokémon favoritos, configuraciones y mucho más en la aplicación

# continueButton
source: Continue
es: Continuar

# letsStartButton
source: Let's Start
es: Empecemos

# favoritesEmptyTitle
source: You haven't marked any Pokémon as favorite
es: No has marcado ningún Pokémon como favorito

# favoritesEmptySubtitle
source: Click on the heart icon of your favorite Pokémon and they will appear here.
es: Haz clic en el ícono de corazón de tus Pokémon favoritos y aparecerán aquí.

# searchPokemon
source: Search Pokémon...
es: Procurar Pokémon...

# noResultsFound
source: No Pokémon found
es: No se encontraron Pokémon

# tryAnotherSearch
source: Try another name or number
es: Intenta con otro nombre o número

# resultsFound
source: {count} results found
es: Se han encontrado {count} resultados

source: Clear filter
es: Borrar filtro

# filterByPreferences
source: Filter by your preferences
es: Filtra por tus preferencias

source: Type
es: Tipo

source: Apply
es: Aplicar

source: Cancel
es: Cancelar

source: Favorites
es: Favoritos

source: Delete
es: Eliminar

# confirmDelete
source: Confirm deletion
es: Confirmar eliminación

# confirmDeleteMessage
source: Do you want to remove {name} from your favorites?
es: ¿Deseas eliminar a {name} de tus favoritos?
